insert into "speciality" ("specialityName")
values ('Информационные системы и технологии'),
       ('Программная инженерия'),
       ('Вычислительная техника'),
       ('Прикладная информатика'),
       ('Управление системами'),
       ('Математика и компьютерные науки'),
       ('Радиотехника'),
       ('Биология'),
       ('Приборостроение'),
       ('Информационная безопасность');

insert into "employee" ("firstName", "lastName", "patronymic")
values ('Кириллова', 'Светлана', 'Юрьевна'),
       ('Озерова', 'Марина', 'Игоревна'),
       ('Шамышева', 'Ольга', 'Николаевна'),
       ('Вершинин', 'Виталий', 'Васильевич'),
       ('Курочкин', 'Сергей', 'Васильевич'),
       ('Проскурина', 'Галина', 'Владимировна'),
       ('Салех', 'Хади', 'Мухаммед'),
       ('Ланская', 'Майя', 'Сергеевна'),
       ('Данилов', 'Владислав', 'Валерьевич'),
       ('Жигалов', 'Илья', 'Евгеньевич');
